imacc2019/index.html
<!doctype html>
<html lang="en">
<head>
<title>17th IMA International Conference on Cryptography and Coding</title>
<!-- 2019-07-12 Fri 11:38 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="Martin R. Albrecht">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-9"><h1 class="title">17th IMA International Conference on Cryptography and Coding</h1>
<p>
<b>16 - 18 December 2019, St Anne’s College, University of Oxford</b>
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Updates</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>2019-07-12: Paper Submission Deadline Extended to <b>19 July 2019, 6pm (UK Time)</b>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Important Dates</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><b>Submission Deadline:</b> 19 July 2019 (Papers) and 14 August 2019 (Presentations)
</li>
<li><b>Author Notification:</b> 5 September 2019 (Papers) and 5 October 2019 (Presentations)
</li>
<li><b>Proceedings Version Deadline:</b> 22 September 2019 (Papers)
</li>
<li><b>Conference:</b> 16 to 18 December 2019
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Invited Speakers</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Cas Cremers (CISPA Helmholtz Center for Information Security, Germany)
</li>
<li>Nadia Henninger (University of California, San Diego)
</li>
<li>Clémentine Maurice (French National Centre for Scientific Research (CNRS), France)
</li>
<li>Francesca Musiani (French National Centre for Scientific Research (CNRS), France)
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Registration / Practical Information</h2>
<div class="outline-text-2" id="text-4">
<p>
See <a href="https://ima.org.uk/11167/17th-ima-international-conference-on-cryptography-and-coding/">https://ima.org.uk/11167/17th-ima-international-conference-on-cryptography-and-coding/</a>
</p>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Calls</h2>
<div class="outline-text-2" id="text-5">
<p>
The mathematical theory and practice of both cryptography and coding underpins the provision of effective security and reliability for data communication, processing and storage. This seventeenth International Conference in an established and successful IMA series on the theme of "Cryptography and Coding" solicits original <b>research papers</b> and <b>presentations</b> on all technical aspects of cryptography and coding.
</p>

<p>
Submissions are welcome on any cryptographic or coding-theoretic topic including, but not limited to:
</p>

<ul class="org-ul">
<li>Foundational theory and mathematics;
</li>
<li>The design, proposal, and analysis of cryptographic or coding primitives and protocols
</li>
<li>Secure implementation and optimisation in hardware or software; and
</li>
<li>Applied aspects of cryptography and coding.
</li>
</ul>
</div>

<div id="outline-container-sec-" class="outline-3">
<h3 id="sec-">Call for Papers</h3>
<div class="outline-text-3" id="text-">
<p>
The proceedings will be published in Springer's Lecture Notes in Computer Science series, and will be available at the conference.
</p>

<p>
Submissions must not substantially duplicate work that any of the authors has published elsewhere or has submitted in parallel to a journal or any other conference or workshop with proceedings. Accepted submissions may not appear in any other conference or workshop that has proceedings. Authors of accepted papers must guarantee that their paper will be presented at the conference and must make a full version of their paper available online.
</p>

<p>
All submissions will be blind-reviewed. Papers must be anonymous, with no author names, affiliations, acknowledgements, or obvious references. Submissions should begin with a cover page containing title, a short abstract, and a list of keywords. The body of the paper should be at most 14 pages, excluding the title page with abstract, the bibliography, and clearly marked appendices. Committee members are not required to review appendices, so the paper should be intelligible and self-contained within this length. The submission must be in <a href="https://www.springer.com/gb/computer-science/lncs/conference-proceedings-guidelines">Springer’s LNCS format</a> (LaTeX). Submissions not meeting these guidelines risk rejection without consideration of their merits.
</p>

<p>
Submissions should be submitted via <a href="https://easychair.org/conferences/?conf=imacc2019">EasyChair</a>.
</p>
</div>
</div>

<div id="outline-container-sec-" class="outline-3">
<h3 id="sec-">Call for Presentations</h3>
<div class="outline-text-3" id="text-">
<p>
The main criteria for acceptance are whether the committee believes that the proposed talk will be of interest and of appropriate quality to present to the IMACC audience:
</p>

<p>
Submissions must comply with the following rules:
</p>

<ul class="org-ul">
<li>Submissions can be full papers (maximum 10 pages), abstracts (maximum 2 pages), or the expected presentation slides.
</li>
<li>Submissions must be non-anonymous and must clearly specify which author will give the talk.
</li>
<li>The submission should provide sufficient detail to explain what the talk will be about.
</li>
</ul>

<p>
As these presentations do not enter the formal proceedings (see accompanying Call for Papers), we accept and encourage contributed talk proposals which correspond to papers that are under submission or already published elsewhere.
</p>

<p>
Presentations should be submitted via <a href="https://easychair.org/conferences/?conf=imacc2019">EasyChair</a>.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Committees</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-" class="outline-3">
<h3 id="sec-">Programme Committee</h3>
<div class="outline-text-3" id="text-">
<ul class="org-ul">
<li>Adeline Roux-Langlois, Univ Rennes, CNRS, IRISA, France
</li>
<li>Alex Davidson, Cloudflare, UK
</li>
<li>Benjamin Dowling, Information Security Group, Royal Holloway, University of London, UK
</li>
<li>Caroline Fontaine, CNRS, France, LSV lab, France
</li>
<li>Carolyn Whitnall, University of Bristol, UK,
</li>
<li>Christian Janson, Technische Universität Darmstadt, Germany
</li>
<li>Christian Rechberger, TU Graz, Austria
</li>
<li>Christoph Striecks, AIT Austrian Institute of Technology, Austria
</li>
<li>Christophe Petit, School of Computer Science, University of Birmingham, UK
</li>
<li>Ciara Rafferty, Queen's University Belfast, UK
</li>
<li>Cong Ling, Imperial College London, UK
</li>
<li>Daniel Page, University of Bristol, UK
</li>
<li>Elizabeth Quaglia, Information Security Group, Royal Holloway, University of London, UK,
</li>
<li>Emmanuela Orsini, COSIC, KU Leuven, Belgium
</li>
<li>Julia Hesse, IBM Research - Zurich, Switzerland
</li>
<li>Martin Albrecht, Information Security Group, Royal Holloway, University of London, UK (<b>Chair</b>)
</li>
<li>Rachel Player, Information Security Group, Royal Holloway, University of London, UK
</li>
<li>Roope Vehkalahti, Aalto University, Finland
</li>
<li>Thyla van der Merwe, Mozilla, UK
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-" class="outline-3">
<h3 id="sec-">Steering Committee</h3>
<div class="outline-text-3" id="text-">
<ul class="org-ul">
<li>Liqun Chen, University of Surrey, UK
</li>
<li>Bahram Honary, School of Computing and Communication, University of Lancaster, UK
</li>
<li>Máire O'Neill, Centre for Secure Information Technologies, ECIT, Queen's University Belfast, UK
</li>
<li>Christopher Mitchell, Information Security Group, Royal Holloway University of London, UK
</li>
<li>Matthew Parker, Institute for Informatics, University of Bergen, Norway
</li>
<li>Kenneth Paterson, Information Security Group, Royal Holloway University of London, UK
</li>
<li>Fred Piper, UK
</li>
<li>Martijn Stam, Simula UiB, Norway
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Code of Conduct</h2>
<div class="outline-text-2" id="text-7">
<p>
We are committed to providing an experience free of harassment and discrimination at the IMA CCC conference, respecting the dignity of every participant.
</p>

<p>
If you experience harassment or discriminatory behavior at IMA CC, we encourage you to reach out to the Conference Chair Martin Albrecht or Ciara Rafferty.
</p>

<p>
Participants who violate this code may be sanctioned and/or expelled from the event, at the joint discretion of the Conference Chair and Ciara Rafferty. Any action will only be taken with the consent of the complaining party. UK law applies.
</p>

<p>
If you witness harassment or discriminatory behavior, please consider intervening.
</p>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Further Information</h2>
<div class="outline-text-2" id="text-8">
<p>
For further details on the conference, please contact the IMA Conferences Department:<br >
Email: <a href="mailto:conferences@ima.org.uk">conferences@ima.org.uk</a><br >
Tel: +44 (0) 1702 354 020<br >
Institute of Mathematics and its Applications, Catherine Richards House, 16 Nelson Street, Southend-on-Sea, Essex, SS1 1EF, UK
</p>

<p>
See also <a href="https://ima.org.uk/11167/17th-ima-international-conference-on-cryptography-and-coding/">https://ima.org.uk/11167/17th-ima-international-conference-on-cryptography-and-coding/</a>
</p>
</div>
</div>
</div><div class="col-md-3"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. Updates</a></li>
<li><a href="#sec-2">2. Important Dates</a></li>
<li><a href="#sec-3">3. Invited Speakers</a></li>
<li><a href="#sec-4">4. Registration / Practical Information</a></li>
<li><a href="#sec-5">5. Calls</a>
<ul class="nav">
<li><a href="#sec-">Call for Papers</a></li>
<li><a href="#sec-">Call for Presentations</a></li>
</ul>
</li>
<li><a href="#sec-6">6. Committees</a>
<ul class="nav">
<li><a href="#sec-">Programme Committee</a></li>
<li><a href="#sec-">Steering Committee</a></li>
</ul>
</li>
<li><a href="#sec-7">7. Code of Conduct</a></li>
<li><a href="#sec-8">8. Further Information</a></li>
</ul>
</div>
</nav>
</div></div></div>
</body>
</html>
